app/controllers/products_controller.rb

  def index
    @products = Product.find(:all)
---
SELECT * FROM "products" WHERE ("products"."id" = 953125641)

  def create
    @product = Product.new(params[:product])
    #val1, val2 = params[:product][:price].split(".")

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("image_url", "updated_at", "title", "price", "description", "created_at") VALUES('http://example.com/foo.gif', '2009-02-02 23:31:08', 'awesome product', 100, 'awesome product description', '2009-02-02 23:31:08')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM "products" WHERE ("products"."id" = 953125641)
UPDATE "products" SET "title" = 'mega awesome title', "updated_at" = '2009-02-02 23:52:28' WHERE "id" = 953125641

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT * FROM "products" WHERE ("products"."id" = 953125641)
DELETE FROM "products" WHERE "id" = 953125641