app/controllers/store_controller.rb

  def add_to_cart
    begin
      product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 0)

  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO "line_items" ("order_id", "updated_at", "total_price", "product_id", "quantity", "created_at") VALUES(996332878, '2009-02-16 06:51:45', 1099, 953125641, 1, '2009-02-16 06:51:45')
INSERT INTO "orders" ("name", "updated_at", "pay_type", "address", "email", "created_at") VALUES('Jordan Dobson', '2009-02-16 06:51:45', 'po', '1121 S. East Street, Tacoma, Wa 98405', 'bob@bob.com', '2009-02-16 06:51:45')