app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :name)
---
SELECT * FROM "users" WHERE ("users"."id" = 132234702) LIMIT 1

  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "hashed_password", "created_at") VALUES('elvis', '176921100.777663363403523', '2009-02-19 03:31:28', '8ac4b4ff70a0dafe9bc92d47611063bebf02f0d4', '2009-02-19 03:31:28')

  def update
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 132234702) LIMIT 1
UPDATE "users" SET "name" = 'elizabeth', "updated_at" = '2009-02-22 07:07:46' WHERE "id" = 927228386

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 132234702) LIMIT 1
DELETE FROM "users" WHERE "id" = 927228386